import { useLocation } from 'react-router-dom'

import Layout from '@components/Layout'
import Breadcrumbs from '@components/Breadcrumbs'
import Tile from '@components/Tile'

import s from './articles.module.scss'

const Hotline = () => {
    const location = useLocation()

    const from = location.state?.from?.pathname || '/'

    return (
        <Layout>
            <Breadcrumbs path={from}>Гаряча лінія</Breadcrumbs>
            <div className={s.container}>
                <Tile className={`${s.articles} ${s.articlesExact}`}>
                    <h3>
                        «Гаряча лінія» для психологічної допомоги українцям, які постраждали від
                        війни
                    </h3>
                    <p>
                        Міністерство охорони здоров'я України нагадує, що в Україні працює «гаряча
                        лінія», спеціалісти якої допомагають українцям підтримати психічне здоров’я
                        в умовах постійного стресу й емоційної напруги, спричинених війною. <br />
                        <br />
                        «Гаряча лінія» за номером <b>0-800-100-102</b> працює{' '}
                        <b>щодня з 10:00 до 20:00</b>. Дзвінки з України є безоплатними.
                        Консультації надають фахові психологи з багаторічним досвідом, які
                        попередньо пройшли спеціальну підготовку для роботи зі складними кризовими
                        ситуаціями. Лінія працює у двох форматах: через аудіо- та відеозв’язок. Для
                        отримання відеосеансу особа, яка звернулася по допомогу, має повідомити про
                        своє бажання оператору лінії. <br />
                        <br />
                        Крім того, лінія приймає дзвінки громадян України, які перебувають в інших
                        країнах за номерами: <br />
                        <br />
                        <li>+48 800 088 141 – у Польщі,</li>
                        <li>+420 800 012 058 – у Чехії,</li>
                        <li>+33 805 080 466 – у Франції,</li>
                        <li>+351 800 780 756 – у Португалії,</li>
                        <li>+46 20 160 46 46 – у Швеції,</li>
                        <li>+353 1800 817 519 – в Ірландії,</li>
                        <li>+39 800 939 092 – в Італії,</li>
                        <li>+43 800 017967 – в Австрії,</li>
                        <li>+44 808 164 2432 – у Великобританії.</li>
                        <br />
                        Дзвінки з усіх мобільних операторів цих країн на відповідні номери також є
                        безоплатними. <br />
                        Роботу «гарячої лінії» підтримує Програма розвитку Організації Об’єднаних
                        Націй (ПРООН) за фінансової підтримки Європейського Союзу. Ініціатива
                        створення «гарячої лінії» для надання первинної психологічної допомоги
                        належить Національній психологічній асоціації та впроваджується під її
                        керівництвом. До розроблення «гарячої лінії» та підтримки її роботи також
                        долучилися Американська психологічна асоціація та компанія Amazon. <br />
                        Кількість країн, підключених до мережі психологічної допомоги, буде
                        розширюватися. Додаткова інформація публікуватиметься на сайті Національної
                        психологічної асоціації.
                    </p>
                </Tile>
            </div>
        </Layout>
    )
}
export default Hotline
