import Layout from '@components/Layout'
import Tile from '@components/Tile'
import Button from '@components/Button'

import s from './main.module.scss'

const Main = () => {
    return (
        <Layout>
            <div className={s.tiles}>
                <Tile dark className={s.area1}>
                    <h5>Афірмація дня</h5>
                    <p>
                        Щоразу, коли ми боїмося, це тому, що ми недостатньо
                        знаємо. Якби ми достатньо розуміли, ми б ніколи не
                        боялися
                    </p>
                </Tile>
                <Tile className={s.area2}>
                    <h5>Вперше на нашому сайті?</h5>
                    <p>
                        Зареєструйтесь або увійдіть в існуючий обліковий запис
                        для детальнішої інформації про себе
                    </p>
                    <Button>Зареєструватись</Button>
                </Tile>
                <Tile className={s.area3}>
                    <h5>
                        Маніпуляція людьми – цікаві факти про психологічне
                        насильство
                    </h5>
                    <p>
                        Маніпуляція людьми в наш час активно використовується,
                        будьте обережні! Здається, що Ви всюди винні, усюди
                        недопрацював і переслідує думка: “Я не зможу, у мене не
                        вийде, я – нікчемний”? Скоріш за все, що вами банально
                        маніпулюють. <br />
                        Фізичне насильство – штука категорично неприпустима. А
                        ось про психологічне насильство мало хто з нас
                        замислюється. Але моральне придушення – штука ані трохи
                        не менш серйозна, ніж силова агресія: воно шкодить не
                        тільки тілу (опосередковано), а перш за все особистості,
                        позначається на самооцінці, на здатності людини керувати
                        своїм життям. І якщо на фізичний удар можна відповісти,
                        то як “дати здачі” тонкому маніпулятору – не зовсім
                        зрозуміло. <br />
                        Та й де психологічна агресія, а де “просто здалося”, теж
                        розібратися нелегко. Є п’ять найбільш поширених методів,
                        які психологи називають агресією. Якщо ти виявиш якийсь
                        із них у своїх взаєминах з іншою людиною, знай: це –
                        воно. Чини опір або біжи. <br />
                        Термін “газлайтинг” увійшов в наше життя від кіношників:
                        “Газлайт” (Gaslight, “газова лампа”) – так називався
                        фільм 1944 року з Інгрід Бергман у головній ролі. За
                        сюжетом чоловік її героїні хотів прибрати до рук
                        коштовності дружини. Він розумів, що може зробити це,
                        тільки якщо дружину визнають неосудною і примусово
                        покладуть в психіатричну лікарню. <br />
                        Щоб реалізувати ідею, чоловік встановив в будинку газове
                        освітлення, зробивши так, щоб в певний момент газові
                        лампи гасли...
                    </p>
                    <Button>Переглянути статті</Button>
                </Tile>
                <Tile className={s.area4}>
                    <h5>Тест на тривоність</h5>
                    <p>
                        Спираючись на клінічні дані та дослідження, цей тест
                        визначає Ваш поточний рівень тривожності, стресу та
                        депресії відповідно до стандартизованих науково
                        обґрунтованих показників. Хоча всі ми час від часу
                        перебуваємо у тривожному, стресовому і навіть
                        депресивному стані, особливо високі показники цих
                        параметрів можуть перешкоджати людині вести звичайний
                        спосіб життя і спровокувати цілу низку різноманітних
                        розладів здоров’я. Проте, з цими негативними станами
                        можна боротися, і часто саме усвідомлення проблеми – це
                        перший крок до її вирішення. У кожному наступному
                        твердженні вкажіть, наскільки Ви погоджуєтеся чи не
                        погоджуєтеся з ним. <br />
                        Цей тест створений для того, щоб надати чітку клінічну
                        картину поточного рівня тривожності, стресу та депресії
                        респондентів відповідно до стандартизованих показників.
                    </p>
                    <Button>Пройти тест</Button>
                </Tile>
                <Tile
                    className={s.area5}
                    img="https://i.picsum.photos/id/483/2000/3000.jpg?hmac=ZwWHf5kp6VIY6h699lfQs8kIYz0j9gmbwT3XH0gMyfE"
                ></Tile>
            </div>
        </Layout>
    )
}
export default Main
