from Database import Database

db = Database()
db.create_tables()


db.exec('''
    INSERT INTO users (username, password, email, isAdmin)
    VALUES (?, ?, ?, ?)
''', ['admin', 'admin', 'admin@gmail.com', 1])



title = 'Медитація для зниження інтенсивності ранкової тривожності'
content = """
Ранкова тривожність може проявлятись у вигляді надмірного занепокоєння та роздумів про майбутній день, неприємних відчуттів у тілі та поверхового дихання. Для того, щоб справлятись з ранковою тривогою, потрібно виробити звичку починати день з турботи про свій стан. Ранкова рутина сприятиме заземленню і допоможе зберігати емоційну стабільність. Тому рекомендую виконувати цю медитацію кожного ранку.
"""
db.exec('''
    INSERT INTO meditations (title, content)
    VALUES (?, ?)
''', [title, content])


title = 'Практика визначення пріорітетів за книгою Ґреґа Маккеона «Есенціалізм»'
content = """
Eсенціаліст – це людина яка вміє відпускати зайве, казати «ні» неважливим речам і концентруватись на пріорітетах. Пріорітети- це те, що відповідає нашим цінностям. Використовуючи принципи есенціалізму можна відчути більше спокою і задоволення від життя. Як зазначає автор, шлях есенціаліста – налаштуватися на теперішній момент, тому хай ця медитація стає острівком дослідження себе і зосередження на тому що для вас важливо прямо зараз. Не вчора, не через годину. А тут і зараз.
"""
db.exec('''
    INSERT INTO meditations (title, content)
    VALUES (?, ?)
''', [title, content])


title = 'Медитація "Очищення і наповнення" / Хороші переконання про себе'
content = """
Медитація, що додасть більше спокою і ясності в життя. Вона складається з двох частин: в першій частині ми звільняємось від думок та неспокою, а в іншій – наповнюємо звільнений простір хорошими переконаннями про себе і світ.
"""
db.exec('''
    INSERT INTO meditations (title, content)
    VALUES (?, ?)
''', [title, content])


title = 'Медитація для збалансування емоцій'
content = """
Медитація, що збалансує ваші емоції та допомооже вам знайти шлях до внутрішнього спокою.
"""
db.exec('''
    INSERT INTO meditations (title, content)
    VALUES (?, ?)
''', [title, content])


title = 'Медитація будь-де | Під звуки дощу'
content = """
Медитація, яку можна практикувати будь-де. В житті бувають різні ситуації, коли в нас нема можливості побути наодинці, наприклад нароботі. В такі моменти варто пам'ятати, що медитація - це не тільки сидіння в позі лотоса, але й резонування з усім, що відбувається навколо. Для цієї медитації не потрібна особлива поза. Ви можете стояти, сидіти або лежати, як вам зручно. Також не обов'язково заплющувати очі.
"""
db.exec('''
    INSERT INTO meditations (title, content)
    VALUES (?, ?)
''', [title, content])






title = 'Маніпуляція людьми – цікаві факти про психологічне насильство'

content = """
Маніпуляція людьми в наш час активно використовується, будьте обережні! Здається, що Ви всюди винні, усюди недопрацював і переслідує думка: “Я не зможу, у мене не вийде, я – нікчемний”? Скоріш за все, що вами банально маніпулюють.

Фізичне насильство – штука категорично неприпустима. А ось про психологічне насильство мало хто з нас замислюється. Але моральне придушення – штука ані трохи не менш серйозна, ніж силова агресія: воно шкодить не тільки тілу (опосередковано), а перш за все особистості, позначається на самооцінці, на здатності людини керувати своїм життям. І якщо на фізичний удар можна відповісти, то як “дати здачі” тонкому маніпулятору – не зовсім зрозуміло.

Та й де психологічна агресія, а де “просто здалося”, теж розібратися нелегко. Є п’ять найбільш поширених методів, які психологи називають агресією. Якщо ти виявиш якийсь із них у своїх взаєминах з іншою людиною, знай: це – воно. Чини опір або біжи.

Газлайтинг
Термін “газлайтинг” увійшов в наше життя від кіношників: “Газлайт” (Gaslight, “газова лампа”) – так називався фільм 1944 року з Інгрід Бергман у головній ролі. За сюжетом чоловік її героїні хотів прибрати до рук коштовності дружини. Він розумів, що може зробити це, тільки якщо дружину визнають неосудною і примусово покладуть в психіатричну лікарню.


Щоб реалізувати ідею, чоловік встановив в будинку газове освітлення, зробивши так, щоб в певний момент газові лампи гасли. Кожен раз, коли це відбувалося в присутності благовірної, зловмисник запевняв, що їй це вважається, – і в результаті майже довів дружину до нервового зриву і недієздатності.

У побуті газлайтинг виглядає приблизно так: “Ти ж сам казав, що ці вихідні ми проведемо вдома удвох!” – висловлює засмучена дружина чоловікові, котрий зібрався на риболовлю і чує у відповідь: “Я?! Говорив?! У тебе з головою все в порядку?” Або: “Мені не подобається, що ти мені грубиш”, – говорить чоловік своїй “половині” і чує: “Я грублю?! Що за маячня! А-а, я знаю, це тебе твоя мама проти мене налаштовує!”

Сенс газлайтингу – в постійному прихованому знеціненні почуттів і інтелектуальних здібностей людини. “Агресор” – газлайтер транслює своїй “жертві”: ти не сповна розуму, ти не здатна пам’ятати і аналізувати інформацію у тебе не може бути своєї думки, крім нав’язаного ззовні. І “жертва” дійсно починає сумніватися у власній адекватності, втрачаючи можливість управляти своїм життям ( “адже я ж дура (-к), я нічого не пам’ятаю, що я можу”) і опиняючись повністю підпорядкованої “агресору”.

Знецінення
З цим маніпулятивним методом стикалися багато – його часто транслюють навіть люблячі батьки своїм дітям. “Це прекрасно, що ти зайняв таку посаду але в твої роки багато досягають куди більшого!”. “Ти сьогодні прекрасно виглядаєш! Не Ангеліна Джолі, звичайно і костюмчик не Шанель, але в загальному нічого, для нашої провінції зійде”.


Подібні словесні конструкції заганяють мозок “жертви” в ступор: начебто і похвалили, що приємно але при цьому тут же вмокнули в бруд. В результаті людина, навіть досяг успіху і зриває море компліментів у інших людей, поруч з “агресором” починає сумніватися у власних талантах, відчуває себе втраченим і нікчемним. “Жертва” підсвідомо прагне прислужити перед “агресором” – щоб отримати щирий комплімент без “але”, але… Це не вдасться: агресору вигідно підтримувати низьку самооцінку у партнера, щоб той нікуди не втік …

Позбавлення соціальних зв’язків


“Твої подруги – дурепи, я б не хотів, щоб ти з ними спілкувалася! Про що взагалі така розумна дівчина, як ти може розмовляти з ними ?!” Або: “Так, звичайно, твої друзі – хороші люди але вони ж невдахи, милий! Я б не хотіла, щоб такий перспективний чоловік, як ти, з ними спілкувався”. Або: “Твої батьки налаштовують тебе проти мене! Обирай: я, наша сім’я – або вони!”

 

“Агресор” всіма силами намагається відрізати “жертву” від його звичного соціального кола спілкування – близьких, друзів, сім’ї. З простої причини: коло спілкування – це наша підтримка, це наше місце в соціумі. Немає підтримки, немає місця – і ти опиняєшся в підвішеному стані, втрачаєш ґрунт під ногами і в результаті стаєш залежним лише від єдиної людини, яка залишилася поруч, – “агресор”.

Узагальнення і голослівні твердження
“Ти вічно всім незадоволена!” – говорить чоловік в обличчя дружині, яка прийшла до нього обговорити той факт, що вона втомилася збирати розкидані по будинку шкарпетки. “Так ти ніколи нічого не робиш, тебе навіть сміття винести НЕ допросишся!” – кричить дружина чоловікові.

Сенс узагальнень в тому, що вони не дають обговорити конкретну проблему, яка хвилює того чи іншого члена сім’ї. Замість цього “агресор” витягує з пам’яті всі проступки і гріхи “жертви” і робить з них глобальний висновок: “Так ти завжди …!”

З узагальненнями сперечатися вкрай важко: поки ти намагаєшся виправдатися ( “Ну чому незадоволена, я щаслива, коли ми гуляємо разом” або “Як це нічого не роблю, я ж пилосошу і білизну гладжу!”), актуальна проблема, обговорити яку ви, власне і прийшли, розчиняється в потоці слів. І залишається не обговореною.

Використання ваших слів проти вас

Цей маніпулятивний метод дозволяє “агресорам” ухилятися від відповідальності за свої вчинки. Наприклад, дружина каже чоловікові: “Мене не влаштовує, якою тональністю ти зі мною розмовляєш” – і чує на свою претензію таку відповідь: “Ах, а ти у нас, бачте, сама досконалість ?!” або “Тобто я, як ти вважаєш, поганий, а ти хороша?”

Це дає “агресору” можливість вбити відразу двох зайців: по-перше, він іде від обговорення проблеми (тони), а по-друге, прищеплює “жертві” почуття провини ( “Дійсно, я ж теж недосконала”, – думає вона).

В результаті проблема виявляється не вирішена і напевно спливе знову. Або не спливе – якщо “жертва” оброблена в достатній мірі і вважає, що не має морального права вимагати у партнера поважати її почуття.

Як впоратися з психологічним насильством? Це питання окреме. Але перший крок – навчитися насильство виявляти і розуміти, що таке маніпуляція людьми. І розуміти, що “агресор” просто намагається обрубати вам крила.
"""
db.exec('''
    INSERT INTO articles (title, content, authorId)
    VALUES (?, ?, ?)
''', [title, content, 1])






title = 'Психологічні ефекти, що перешкоджають вашому успіху'

content = """
Давно в нас не було статті по психології, тоді давайте трохи дізнаємося що приховує психологія людини!

Здається Ви зробили все, що могли але з поставленим завданням – робочої, кар’єрної, особистої – так і не впоралися. Перевірте: можливо, вас підводять елементарні глюки, властиві людській психіці?

Психологи запевняють: часто той фактор, який заважає нам досягти успіху, – це ми самі. Точніше, ряд глибинних стереотипів, що засіли в наших головах.

Є кілька дивовижних психологічних ефектів, яким піддається абсолютно кожен і далі в статті ми з вами про них поговоримо.

Ефект Рінгельмана

Пам’ятаєте стару притчу, чи то анекдот про воду у винній бочці? Зараз нагадаємо. Якось в одному селі проходило велике свято. Селяни домовилися: на площі встановлять велику бочку, в яку кожен учасник майбутнього бенкету виллє відро вина. Але коли почалося застілля і присутні розлили по келихах вміст бочки, виявилося, що всередині була звичайна водиця. Просто один житель вирішив наступне: «Якщо в бочку вина я виллю відро води, ніхто цього не помітить». Він не міг навіть припускати, що така ж ідея прийде в голову кожному селянинові, який проживає в селі…

Власне, ефект, 90 років тому виявлений психологом Максиміліаном Рінгельманом, пояснює події в цій притчі. У 1927-му вчений провів серію цікавих експериментів, в рамках яких просив добровольців піднімати різноманітні тяжкості, а потім фіксував максимальну вагу яку кожна людина піднімала. Пізніше піддослідних змішали в групи по два, чотири і вісім чоловік і знову просили підняти щось важке – але вже спільними зусиллями.

Очікування були логічними: коли один випробуваний, умовно, піднімав 100 кг, то дві людини повинні були б подужати 200, а то і більше – адже крилате уявлення про те, що «гуртом і бандита легше бити» (в тому сенсі, що командна робота надає можливість досягати набагато більших результатів), існувало вже тоді.

Але Рінгельмана чекало розчарування. Як з’ясувалося, двоє людей піднімали лише 90% від суми їх індивідуальних показників – тобто на двох могли здолати лише 180 кг замість очікуваних 200. А якщо за справу бралися восьмеро, то результат знижувався ще більш вражаючим – піддослідні освоювали тільки 50% від еталонної ваги, тобто вісім чоловік могли впоратися лише з 400 кг (так що на кожного припадало лише 50 кг).

Як показали подальші дослідження, працюючи поодинці – тобто покладаючись тільки на себе, люди показують високі результати. А ось включившись в групу, ми підсвідомо прагнемо економити сили – і в результаті «халтуримо».

Висновок: якщо хочеш досягти успіху, покладайся насамперед на себе. Дій усвідомлено, без оглядки і надії на людей які вас оточують. Так Ви зможете досягти більшого. А при потребі або психологічну кризу, можна відвідати професійного психолога і вивчити уважніше його рекомендації.

Ефект Лачинс

Давним-давно знаменитий психолог Вернер Ерхард придумав розгорнуту метафору для опису поведінкових особливостей простих людей (як він вважав, невдах): «Уявіть, що ви запускаєте в лабіринт щурів. В кінці лабіринту лежить сир. Через час щури запам’ятовують досить непростий шлях до сиру і з задоволенням їдять свою нагороду. У якийсь момент ви перекладаєте сир в інше місце, а потім і зовсім забираєте. Але щури, нездатні прийняти змінені правила гри, знову і знову продовжать долати перешкоди, щоб потрапити в ту точку, де вже давно нічого немає … »
Ерхард говорив про невдах. Але всього кілька десятиліть потому інший психолог, Абрахам Лачинс, виконав схожий експеримент з людьми – інтелігентними і розвиненими. І з жахом виявив: вони мало чим відрізняються від щурів.

Експеримент, який отримав назву ефект Лачинс, полягав в наступному. Групі студентів пропонували виконати п’ять завдань. І вирішити дані завдання можна було тільки одним єдиним способом, причому вельми непростим способом. Успішно впоравшись із завданнями (і продемонструвавши при цьому дуже неслабкий рівень IQ), група отримувала нові завдання, які вже можна було вирішити двояко: старим важким способом або ж елементарним – очевидним і лежачим на поверхні.

Нові завдання, як ви, можливо, вже передбачили, групи вирішували звичним найскладнішим способом. Але найгірше те, що коли Лачинс давав студентам завдання, що передбачали взагалі інший спосіб розв’язання, вся група ставала в глухий кут і не знаходила відповіді. Щоб знову стати «нормальними» до вирішення нестандартних завдань, студентам потрібно відволіктися від експерименту хоча б на кілька днів.

Ефект Лачинс зафіксував особистісний розлад, властиве практично кожному з нас: люди (за рідкісним винятком) не здатні міняти звичні алгоритми життя і дій в умовах, що змінилися. Щоб подолати цей стереотип, треба перш за все його усвідомити і зізнатися собі в даній слабкості. Усвідомлення допоможе на час відмовитися від проблеми, «злетіти» над нею – лише після цього ми можемо виявляти нестандартні, але більш прості варіанти дій.

Висновок: «я робив так завжди» і «повторення – може навчити» – вірний спосіб привести себе в особистісний розлад і втратити можливість знаходити прості рішення. Не бійся переступати через стереотипи.

Ефект Пігмаліона

На відміну від попередніх ефектів, цей психологічний трюк отримав назву від імені вигаданого персонажа – міфічного скульптора, який своєю увагою і любов’ю зміг оживити статую.

Вперше з ефектом Пігмаліона зіткнувся психолог Роберт Розенталь, який вивчав успішність школярів молодших класів. Він провів цікавий експеримент: на початку року показав вчителям список тих учнів, які нібито продемонстрували дуже високі результати в тестах інтелекту. В кінці року виявилося, що саме ці школярі стали кращими учнями в класі, здавши іспити на «відмінно». Очікувано? А ось і ні. Справа в тому, що Розенталь вибирав прізвища «геніїв» випадково, без прив’язки до їх реального IQ. Кращими цих учнів зробили викладачі, які щиро вірили, що перед ними по-справжньому талановиті діти.

Вчителі вірили, що діти – маленькі генії і діти дійсно продемонстрували приголомшливі результати.

Висновок: чекай від людей хорошого і зможеш запустити «власне пророцтво». Особливо добре ефект Пігмаліона проявляється на власних дітях і на нас самих: ті, хто вірить, що гідний більшого, дійсно це більше отримують. А у що вірите Ви?
"""
db.exec('''
    INSERT INTO articles (title, content, authorId)
    VALUES (?, ?, ?)
''', [title, content, 1])






title = 'Психологія особистості: що улюблена музика може розповісти про людину'

content = """
Всі меломани мають свій смак і відрізняються один від одного як по перевагах, так і за характерами. Як за допомогою музики дізнатися яка психологія особистості людини.

Ми не станемо сильно заглиблюватися в стилі і піджанр але розглянемо кілька категорій популярної сьогодні музики: реп, рок, електронна музика і поп.

Електронна музика

Людина, що віддає перевагу електронному звучанню, схильна до мистецтва і креативним ідеям. Часто це творча особистість, зазвичай неконфліктна.

Якщо шанувальник електронної музики активний і товариський, то в складних ситуаціях частіше за інших проявить нестандартний варіант вирішення.

Якщо людина стримана і небагатослівна, з ним буде приємно проводити час наодинці. Нерідко такі люди займаються живописом, письменством або самі роблять музику.

Реп

Реп вже багато років тримає високу планку популярності в Україні, тому скласти психологічну картину середньостатистичного слухача не складає труднощів. Середній реп-шанувальник – реаліст, який в мистецтві цінує те, наскільки точно воно відображає дійсність. За характером людина тверда в переконаннях і стабільний емоційно.

Репер-екстраверт стає «своїм» в колективі і нерідко є душею компанії. Репер-інтроверт завжди знайде компанію до душі: з огляду на популярність жанру, йому завжди буде про що поговорити.

Поп музика

Яскрава, весела і безтурботна, поп-музика задає позитивний настрій у своїх постійних слухачів. Люди, які вважають за краще поп, завжди «на хвилі» і в курсі модних тенденцій. Вони підтримають будь-яку розмову, пов’язану з популярною культурою.

Відкриті і веселі любителі поп-музики легко заводять знайомства і зазвичай займають стабільне місце в компанії.

Інтровертні поп-слухачі в будь-який момент можуть завести широке коло спілкування, але через сором’язливість роблять це часто в інтернеті. Їх складно витягнути з дому, зате вони завжди онлайн.

Рок

У поняття «рок-музика» входить як класичний рок-н-рол, так і хеві-метал, панк-рок, сучасний хардкор – в загальному, десятки і сотні напрямків. Через таку велику кількість піджанру виділити середнього слухача не дуже легко, але єдині риси у рокерів є: емоційна нестабільність, різка зміна настрою, впертість, вразливість.

Відкритий і говіркий рокер стане божевільною частиною компанії. Розмови про заборонному, нескінченний потік жартів і прямолінійна грубість – все це в тій чи іншій мірі буде присутнє. Компанію такій людині знайти буде непросто, але як тільки вона з’явиться – він неодмінно стане її частиною.

Закритий і мовчазний рокер – повна протилежність першого. Часто він любить перебувати на самоті і слухати улюблені композиції, а його компанія зазвичай не перевищує трьох-чотирьох друзів. Така людина щира і вірна, емоційно прив’язаний і трохи легковажний. Нерідко у цих людей є проблеми з роботою, пошуком себе і сенсу життя, але з появою близьких вони нерідко «пробуджуються».

Впізнали себе? Не варто забувати про те, що кожна людина індивідуальна, і повністю відповідати описаним психологічним ролям не може ніхто. Однак окремі групи людей завжди можна проаналізувати яка психологія особистості, щоб виявити набір поведінкових подібностей між особистостями.
"""
db.exec('''
    INSERT INTO articles (title, content, authorId)
    VALUES (?, ?, ?)
''', [title, content, 1])